In [1]:
import pandas as pd
import numpy as np

In [2]:
calendario = pd.read_csv("data/daily_calendar_with_events.csv")
precios = pd.read_csv("data/item_prices.csv")
ventas = pd.read_csv("data/item_sales.csv")

In [68]:
prod=ventas.groupby(["item","department"]).agg({"id":"count"})
prod=prod.reset_index(drop=False)
prod=prod.reset_index().rename(columns={'index': 'id_item'})
del(prod["id"])
prod

      id_item               item     department
0           0   ACCESORIES_1_001   ACCESORIES_1
1           1   ACCESORIES_1_002   ACCESORIES_1
2           2   ACCESORIES_1_003   ACCESORIES_1
3           3   ACCESORIES_1_004   ACCESORIES_1
4           4   ACCESORIES_1_005   ACCESORIES_1
...       ...                ...            ...
3044     3044  SUPERMARKET_3_823  SUPERMARKET_3
3045     3045  SUPERMARKET_3_824  SUPERMARKET_3
3046     3046  SUPERMARKET_3_825  SUPERMARKET_3
3047     3047  SUPERMARKET_3_826  SUPERMARKET_3
3048     3048  SUPERMARKET_3_827  SUPERMARKET_3

[3049 rows x 3 columns]

In [4]:
sto=ventas.groupby(["store_code","region","store"]).agg({"id":"count"})
sto=sto.reset_index(drop=False)
sto=sto.reset_index().rename(columns={'index': 'id_store'})
del(sto["id"])
sto

   id_store store_code        region              store
0         0      BOS_1        Boston          South_End
1         1      BOS_2        Boston            Roxbury
2         2      BOS_3        Boston           Back_Bay
3         3      NYC_1      New York  Greenwich_Village
4         4      NYC_2      New York             Harlem
5         5      NYC_3      New York            Tribeca
6         6      NYC_4      New York           Brooklyn
7         7      PHI_1  Philadelphia    Midtown_Village
8         8      PHI_2  Philadelphia           Yorktown
9         9      PHI_3  Philadelphia      Queen_Village

In [59]:
city=ventas.groupby(["region"]).agg({"id":"count"})
city=city.reset_index(drop=False)
city=city.reset_index().rename(columns={'index': 'id_city'})
del(city["id"])
city

   id_city        region
0        0        Boston
1        1      New York
2        2  Philadelphia

In [6]:
dep=ventas.groupby(["category","department"]).agg({"id":"count"})
dep=dep.reset_index(drop=False)
dep=dep.reset_index().rename(columns={'index': 'id_dep'})
del(dep["id"])
dep

   id_dep       category       department
0       0     ACCESORIES     ACCESORIES_1
1       1     ACCESORIES     ACCESORIES_2
2       2  HOME_&_GARDEN  HOME_&_GARDEN_1
3       3  HOME_&_GARDEN  HOME_&_GARDEN_2
4       4    SUPERMARKET    SUPERMARKET_1
5       5    SUPERMARKET    SUPERMARKET_2
6       6    SUPERMARKET    SUPERMARKET_3

In [7]:
cat=ventas.groupby(["category"]).agg({"id":"count"})
cat=cat.reset_index()
cat=cat.reset_index().rename(columns={'index': 'id_cat'})
del(cat["id"])
cat

   id_cat       category
0       0     ACCESORIES
1       1  HOME_&_GARDEN
2       2    SUPERMARKET

In [8]:
def extraed(texto):
    partes = texto.split('_')
    if len(partes) > 1:
        return partes[1]
    else:
        return texto

In [9]:
ventas1=ventas.copy()

In [10]:
ventas1["item"] = ventas1["item"].map(prod.set_index("item")["id_item"]).fillna(ventas1["item"])
ventas1["item"] = ventas1["item"].astype(int)

In [11]:
ventas1["category"] = ventas1["category"].map(cat.set_index("category")["id_cat"]).fillna(ventas1["category"])
ventas1["category"] = ventas1["category"].astype(int)

In [12]:
ventas1["department"] = ventas1["department"].map(dep.set_index("department")["id_dep"]).fillna(ventas1["department"])
ventas1["department"] = ventas1["department"].astype(int)

In [13]:
ventas1["store_code"] = ventas1["store_code"].map(sto.set_index("store_code")["id_store"]).fillna(ventas1["store_code"])
ventas1["store_code"] = ventas1["store_code"].astype(int)
del(ventas1["store"])
del(ventas1["region"])

In [14]:
ventas1.head()

,id,item,category,department,store_code,d_1,d_2,d_3,d_4,d_5,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
0,ACCESORIES_1_001_NYC_1,0,0,0,3,0,0,0,0,0,...,1,3,0,1,1,1,3,0,1,1
1,ACCESORIES_1_002_NYC_1,1,0,0,3,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,ACCESORIES_1_003_NYC_1,2,0,0,3,0,0,0,0,0,...,2,1,2,1,1,1,0,1,1,1
3,ACCESORIES_1_004_NYC_1,3,0,0,3,0,0,0,0,0,...,1,0,5,4,1,0,1,3,7,2
4,ACCESORIES_1_005_NYC_1,4,0,0,3,0,0,0,0,0,...,2,1,1,0,1,1,2,2,2,4

In [15]:
ventas2=ventas1.melt(id_vars=ventas1.columns[:5],value_vars=ventas1.columns[5:],var_name="d",value_name="Cantidad") #Transformacion de BD, dias por Fila

In [16]:
ventas2.shape

(58327370, 7)

In [17]:
ventas2.head()

,id,item,category,department,store_code,d,Cantidad
0,ACCESORIES_1_001_NYC_1,0,0,0,3,d_1,0
1,ACCESORIES_1_002_NYC_1,1,0,0,3,d_1,0
2,ACCESORIES_1_003_NYC_1,2,0,0,3,d_1,0
3,ACCESORIES_1_004_NYC_1,3,0,0,3,d_1,0
4,ACCESORIES_1_005_NYC_1,4,0,0,3,d_1,0

In [18]:
calendario2=calendario.copy()

In [19]:
ventas2["d"]=ventas2["d"].apply(extraed)
calendario2["d"]=calendario2["d"].apply(extraed)

In [20]:
ventas2.head()

                       id  item  category  department  store_code  d  Cantidad
0  ACCESORIES_1_001_NYC_1     0         0           0           3  1         0
1  ACCESORIES_1_002_NYC_1     1         0           0           3  1         0
2  ACCESORIES_1_003_NYC_1     2         0           0           3  1         0
3  ACCESORIES_1_004_NYC_1     3         0           0           3  1         0
4  ACCESORIES_1_005_NYC_1     4         0           0           3  1         0

In [21]:
ventas2["Cantidad"].sum() # suma de ventas totales

65695409

In [22]:
calendario2["date"]=pd.to_datetime(calendario2["date"]) # formato fecha en columna date

In [23]:
# crea columnas de dia,semana,mes y aÃ±o a partir de date
calendario2['week'] = calendario2['date'].dt.isocalendar().week
calendario2['day'] = calendario2['date'].dt.day
calendario2['month'] = calendario2['date'].dt.month
calendario2['year'] = calendario2['date'].dt.year

In [24]:
# concatena semana y aÃ±o en un string, agregando el 0 a semanas del 1 al 9
calendario2['week'] = calendario2['date'].dt.isocalendar().week.astype(str)
for i in range(len(calendario2)):
    if int(calendario2.loc[i,'week']) < 10:
        calendario2.loc[i,'week'] = '0'+calendario2.loc[i,'week']
calendario2['year'] = calendario2['date'].dt.isocalendar().year
calendario2['yearweek']=calendario2['year'].astype(str)+calendario2['week']

In [25]:
ventas3=pd.merge(ventas2,calendario2[["d","date","yearweek"]],how="left",on="d") # Join ventas con calendario

In [26]:
ventas3["d"]=ventas3["d"].astype(int)

In [27]:
ventas3.shape

(58327370, 9)

In [28]:
ventas3.head()

,id,item,category,department,store_code,d,Cantidad,date,yearweek
0,ACCESORIES_1_001_NYC_1,0,0,0,3,1,0,2011-01-29,201104
1,ACCESORIES_1_002_NYC_1,1,0,0,3,1,0,2011-01-29,201104
2,ACCESORIES_1_003_NYC_1,2,0,0,3,1,0,2011-01-29,201104
3,ACCESORIES_1_004_NYC_1,3,0,0,3,1,0,2011-01-29,201104
4,ACCESORIES_1_005_NYC_1,4,0,0,3,1,0,2011-01-29,201104

In [29]:
precios2=precios.copy()

In [30]:
precios["yearweek"].isnull().sum() # numero de semanas nulas

243920

In [31]:
precios[precios["yearweek"].isnull()].index

Index([    149,     150,     151,     152,     153,     154,     155,     156,
           416,     417,
       ...
       6965581, 6965582, 6965698, 6965699, 6965700, 6965701, 6965702, 6965703,
       6965704, 6965705],
      dtype='int64', length=243920)

In [32]:
precios2=precios2.drop(precios[precios["yearweek"].isnull()].index)

In [33]:
precios2.reset_index(drop= True,inplace=True)

In [34]:
precios2["yearweek"]=precios2["yearweek"].astype(str)
precios2["yearweek"]=precios2["yearweek"].str.slice(stop=6) # quita .0 del string
precios2["year"]=precios2["yearweek"].str.slice(stop=4) # crea columna con aÃ±o
precios2["semana"]=precios2["yearweek"].str.slice(start=4,stop=6) # crea columna con semana

In [35]:
precios2["id"]=precios2["item"]+"_"+precios2["store_code"] # crea id coditem+codstore

In [36]:
ventas3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58327370 entries, 0 to 58327369
Data columns (total 9 columns):
 #   Column      Dtype
---  ------      -----
 0   id          object
 1   item        int32
 2   category    int32
 3   department  int32
 4   store_code  int32
 5   d           int32
 6   Cantidad    int64
 7   date        datetime64[ns]
 8   yearweek    object
dtypes: datetime64[ns](1), int32(5), int64(1), object(2)
memory usage: 2.8+ GB

In [39]:
ventas4=pd.merge(ventas3,precios2[["id","yearweek","sell_price"]],how="left",on=["id","yearweek"]) #join de ventas y precios

In [ ]:
columnasbase=ventas3.columns[:7].tolist()
columnasbase.append("d")
columnasbase

In [ ]:
ventas3=ventas3.sort_values(columnasbase)
ventas3=ventas3.reset_index(drop=True)

In [ ]:
# ventas4=ventas3.groupby(by=columnasbase).agg({"Cantidad":"sum"})
# ventas4=ventas4.reset_index()

In [ ]:
ventas3

In [41]:
def rellenar_precios_nulos(df):
    items=df["id"].unique()
    for item in items:
        item_subset = df[df["item"] == item]
        item_subset = item_subset.sort_values("date")
        item_subset["sell_price"] = item_subset["sell_price"].fillna(method="ffill").fillna(method="bfill")
        df.loc[item_subset.index, :] = item_subset
    return df.sort_values(['item', 'date'], ascending=[True, True])

In [ ]:
ventas5=rellenar_precios_nulos(ventas4)

In [45]:
ventas4.shape

(58327370, 10)

In [47]:
ventas4[ventas4["sell_price"].isnull()].index # ventas con datos nulos dado a que le semanaaÃ±o era nula

Index([       0,        1,        2,        3,        4,        5,        6,
              7,        8,        9,
       ...
       56154376, 56157066, 56165399, 56166498, 56166589, 56169514, 56171497,
       56172682, 56184866, 56187556],
      dtype='int64', length=12513651)

In [49]:
ventas_nulas=ventas4["Cantidad"].iloc[ventas4[ventas4["sell_price"].isnull()].index].sum() # cuantifica la cantidad de unidades con precio nulo

In [50]:
ventas_nulas

335665

In [52]:
from pathlib import Path  
filepath = Path("data/ventas.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
ventas4.to_csv(filepath,index=False)

In [53]:
from pathlib import Path  
filepath = Path("data/calendario2.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
calendario2.to_csv(filepath,index=False)

In [54]:
from pathlib import Path  
filepath = Path("data/productos2.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
prod.to_csv(filepath,index=False)

In [55]:
from pathlib import Path  
filepath = Path("data/stores.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
sto.to_csv(filepath,index=False)

In [56]:
from pathlib import Path  
filepath = Path("data/departamentos.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
dep.to_csv(filepath,index=False)

In [60]:
from pathlib import Path  
filepath = Path("data/city.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
city.to_csv(filepath,index=False)

In [58]:
from pathlib import Path  
filepath = Path("data/category.csv")  
filepath.parent.mkdir(parents=True, exist_ok=True)  
cat.to_csv(filepath,index=False)

In [66]:
tprod=ventas4.groupby(by="id").agg({"Cantidad":"sum"})
tprod=tprod.reset_index()
tprod[tprod["Cantidad"]==0]

Empty DataFrame
Columns: [id, Cantidad]
Index: []

In [ ]:
columnasbase=ventas3.columns[:7].tolist()
# columnasbase.append("yearweek")
# columnasbase

In [ ]:
ventas5=ventas4.groupby(by=columnasbase).agg({"Cantidad":"sum"})

In [62]:
ventas.groupby(by="id").agg({"store":"count"})

                         store
id
ACCESORIES_1_001_BOS_1       1
ACCESORIES_1_001_BOS_2       1
ACCESORIES_1_001_BOS_3       1
ACCESORIES_1_001_NYC_1       1
ACCESORIES_1_001_NYC_2       1
...                        ...
SUPERMARKET_3_827_NYC_3      1
SUPERMARKET_3_827_NYC_4      1
SUPERMARKET_3_827_PHI_1      1
SUPERMARKET_3_827_PHI_2      1
SUPERMARKET_3_827_PHI_3      1

[30490 rows x 1 columns]